[
    "@_qpxcv Idk.\nI heard about Japan holiday but im not sure.",
    "WHY!?????\n........... https://t.co/tEn0kd1UAz https://t.co/8I93u12RXE",
    "RT @BlacktyonteXavi: [#ONEPIECE1165]\n\nBarrier conquerors haki? 🤔\n\n-Oda could of gotten some inspiration from Dragon ball for this one. Its…",
    "I mean Current Loki? No doubt, dude pose a great power. But a dfless Loki without Ragnir, I can't imagine him beating Harald who was Xebec equal.\n\nGaban and Shanks visited the castle, maybe they helped Loki out?\nCan't wait to see the reveal of that Event. https://t.co/Dc0ByjHuKc",
    "#ONEPIECE1165\nWith all due respect to Loki, he never defeated Harald alone. \nWe're talking about Loki who didn't even have Ragnir and his fruit. \nJust look how strong DR Xebec was. Either Harald stopped himself, or Gaban, Loki, and Shanks somehow stopped Harald together. https://t.co/8tj5IWUOP0",
    "It also appears as if he's made his hands larger (but this could just be the art style). It looks like a small G3 version. Imagine if Garp can make his fists larger, literally another Luffy skill🔥🔥",
    "#ONEPIECE1165\nAfter enveloping his hands in immense Conqueror's Haki, Garp unleashes a Gatling attack where his hands are engulfed in flames/aura like flames (fitting the name Explosion)!!\n\nGarp uses fire attack with Conqueror's Haki, almost similar to Red Hawk of Luffy👀 https://t.co/4rh5yZ2qiY",
    "@Captain_Xebec Anime only, not canon.^^",
    "@Its_B_here I think people shouldn´t forget this fact.\nWe don´t know how much stronger his CoC became, but DR have most likely a impact on it.\n\nSo yeah you are not wrong.",
    "@r_OnePiecenigga It is not exactly like that.\nKaido or Big Mom still got hurt, took damage/wounds.\nXebec don´t take any wound/damage, he cancel the attacks and they don´t work on him.^^",
    "@trxshdeniz Roger and Garp saying it is Xebec CoC.",
    "#ONEPIECE1165 \nI think Xebec CoC works similar to Reiatsu, stronger reiatsu nullifies weaker attacks, Xebec CoC nullifies weaker attacks. You can´t hurt him unless your CoC is equal or stronger. \n\nMaybe a reason why Garling and the Admiral at Reverie had hard time to hurt him. https://t.co/MY8X9r2KS4",
    "@Drvoodooo Remember these who said Garp couldn´t hear Xebec...\nDidn´t last one week.\nAlso his Sky split feat too :)",
    "#ONEPIECE1165 \nGarp and Roger can't harm Xebec even with advanced Conqueror's Haki; he possesses a barrier of Conqueror's Haki that neutralizes attacks, so they can't even hurt him. \n\nTo hurt Xebec, you need a stronger Conqueror's Haki.\n(A reason why they combinated their haki). https://t.co/RFKE0L5QXe",
    "#ONEPIECE1165 \nGill Bastar seems to pose the df power of Perona!!\nWe see him with Ganzu and Stussy leaving God Valley.\n\nSource:\nRedon https://t.co/KqM4vM2oMV",
    "#ONEPIECE1165 \nDuring the battle, Garp and Roger get crushed into the mountain(after a huge CoC clash), we see a sky split!!\n\nSource: \nRedon https://t.co/j5WBTirZZV",
    "#ONEPIECE1165\nRoger attack is called \"Fire God Ace\"\nGarp attack is called \"Infinite Fist Explosion\"🔥🔥 https://t.co/b7vwsqFvUe",
    "RT @TheAniTalk: Garp’s technique is called “Infinite Iron Fist”\nRoger’s technique is called “Flame of Kagutsuchi - Hades\n\n#ONEPIECE1165 #OP…",
    "@sigmarshanks I'm praying bro..\nHope it is not over...😭",
    "To be very honest, guys, I still hope Xebec gets a final chapter in two weeks, because the last panel somehow doesn't feel like \"the big\" final page. \nMaybe I'm just coping too much because I don't want it to end...😭😭😭😭😭"
]